import type { Line } from './types';

export const FARAJ: Line[] = [
  ['بِسْمِ اللهِ الرَّحْمنِ الرَّحِیمِ', 'به نام خداوند بخشنده مهربان', ''],
  [
    'إِلَهِی عَظُمَ الْبَلاءُ وَ بَرِحَ الْخَفَاءُ وَ انْکشَفَ الْغِطَاءُ',
    'خدایا بزرگ شد بلا و گرفتاری و آشكار شد راز پنهانی و پرده از روی كار برافتاد',
    '',
  ],
  [
    'وَ انْقَطَعَ الرَّجَاءُ وَ ضَاقَتِ الْأَرْضُ وَ مُنِعَتِ السَّمَاءُ',
    'و امید قطع شد و زمین (بر ما) تنگ شد و آسمان خودداری كرد',
    '',
  ],
  [
    'وَ أَنْتَ الْمُسْتَعَانُ وَ إِلَیک الْمُشْتَکی وَ عَلَیک الْمُعَوَّلُ فِی الشِّدَّةِ وَ الرَّخَاءِ',
    'و تو یاری دهنده ای،و بدرگاه تو آوریم پروردگارا شِكوه را، و بر تو اعتماد كنیم در سختی و آسانی',
    '',
  ],
  [
    'اَللَّــهُمَّ صَلِّ عَلَی مُحَمَّدٍ وَ آلِ مُحَمَّدٍ أُولِی الْأَمْرِ الَّذِینَ فَرَضْتَ عَلَینَا طَاعَتَهُمْ وَ عَرَّفْتَنَا بِذَلِک مَنْزِلَتَهُمْ',
    'خدایا درود فرست بر محمد و آل او آن بزرگانی كه واجب كردی بر ما فرمانبرداریشان را و بدینوسیله منزلت و مقامشان را به ما شناساندی',
    '',
  ],
  [
    'فَفَرِّجْ عَنَّا بِحَقِّهِمْ فَرَجا عَاجِلا قَرِیبا کلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ',
    'به حق ایشان به ما گشایشی ده فوری و نزدیك مانند چشم بر هم زدن یا نزدیكتر',
    '',
  ],
  ['یا مُحَمَّدُ یا عَلِی یا عَلِی یا مُحَمَّدُ', 'ای محمد ای علی ای علی ای محمد', ''],
  [
    'اِکفِیانِی فَإِنَّکمَا کافِیانِ وَ انْصُرَانِی فَإِنَّکمَا نَاصِرَانِ',
    'یاریم دهید كه به حقیقت شمائید یاور من و كفایتم كنید كه براستی شمائید كفایت كننده من',
    '',
  ],
  ['یا مَوْلانَا یا صَاحِبَ الزَّمَانِ', 'ای مولای من ای صاحب الزمان', ''],
  ['اَلْغَوْثَ الْغَوْثَ الْغَوْثَ', 'به فریادم برس به فریادم برس به فریادم برس', ''],
  ['أَدْرِکنِی أَدْرِکنِی أَدْرِکنِی', 'مرادریاب، مرا دریاب، مرادریاب', ''],
  ['السَّاعَةَ السَّاعَةَ السَّاعَةَ', 'همین ساعت، همین ساعت، همین ساعت', ''],
  ['الْعَجَلَ الْعَجَلَ الْعَجَلَ', 'الان، الان، الان', ''],
  [
    'یا أَرْحَمَ الرَّاحِمِینَ بِحَقِّ مُحَمَّدٍ وَ آلِهِ الطَّاهِرِینَ',
    'ای خدا ای مهربانترین مهربانان به حق محمد و آل پاكیزه‌اش',
    '',
  ],
];
