import type { Line } from './types';

export const TAWASSUL: Line[] = [
  [
    null,
    'علاّمه مجلسی فرموده است: در بعضی از کتاب‌های شایسته احترام از محمّد بن بابویه نقل کرده‌اند که این دعا را از امامان(علیهم‌السلام) روایت کرده و گفته است: در هیچ امری آن را نخواندم مگر آنکه به زودی اثر اجابت آن را یافتم. شیعیان ایران، این دعا را شب‌های چهارشنبه، در مکان‌های مذهبی و به صورت جمعی می‌خوانند.',
    '',
  ],
  [
    'اَللّهُمَّ اِنّى اَسْئَلُكَ وَاَتَوَجَّهُ اِلَيْكَ بِنَبِيِّكَ نَبِىِّ الرَّحْمَةِ مُحَمَّدٍ صَلَّى اللّهُ عَلَيْهِ وَآلِهِ',
    'خدايا از تو مى خواهم و بسويت رو كنم بوسيله پيامبرت پيامبر رحمت محمد صلى الله عليه وآله',
    '',
  ],
  [
    'يا اَبَاالْقاسِمِ يا رَسُولَ اللّهِ يا اِمامَ الرَّحْمَةِ يا سَيِّدَنا وَمَوْلينا',
    'ای ابا القاسم اى رسول خدا اى پيشواى رحمت اى آقاى ما و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار دهيم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'ای آبرومند در نزد خدا براى ما نزد خدا شفاعت كن',
    '',
  ],
  [
    'يا اَبَا الْحَسَنِ يا اَميرَ الْمُؤْمِنينَ يا عَلِىَّ بْنَ اَبيطالِبٍ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    '',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا',
    '',
  ],
  [
    'يا فاطِمَةَ الزَّهْراَّءُ يا بِنْتَ مُحَمَّدٍ يا قُرَّةَ عَيْنِ الرَّسُولِ يا سَيِّدَتَنا وَمَوْلاتَنا',
    'اى فاطمه زهرا اى دختر محمد اى نور چشم پيغمبر اى بانوى ما و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكِ اِلَى اللّهِ وَقَدَّمْناكِ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجت هاى خويش قرار دهيم',
    '',
  ],
  [
    'یا وَجيهَةً عِنْدَ اللّهِ اِشْفَعى لَنا عِنْدَ اللّهِ يا اَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِي اَيُّهَا الْمُجْتَبى يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ',
    'ای آبرومند پيش خدا شفاعت كن براى ما نزد خدا اى ابا محمد اى حسن بن على اى برگزيده اى فرزند رسول خدا اى حجت خدا بر خلق',
    '',
  ],
  [
    'يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'اى آقاى ما و سرور ما ما روآورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    'يا اَبا عَبْدِاللّهِ يا حُسَيْنَ بْنَ عَلِي اَيُّهَا الشَّهيدُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى ابا عبدالله اى حسين بن على اى شهيد (راه حق ) اى فرزند رسول خدا اى حجت بر خلق اى آقا و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا براى ما پيش خدا شفاعت كن',
    '',
  ],
  [
    'یا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ الْحُسَيْنِ يا زَيْنَ الْعابِدينَ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'ای ابا الحسن اى على بن الحسين اى زيور پرستش كنندگان اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خود قرار دهيم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    'يا اَبا جَعْفَرٍ يا مُحَمَّدَ بْنَ عَلِي اَيُّهَا الْباقِرُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى اباجعفر اى محمد بن على اى شكافنده علوم اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما،',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار دهيم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    'يا اَبا عَبْدِ اللّهِ يا جَعْفَرَ بْنَ مُحَمَّدٍ اَيُّهَا الصّادِقُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى اباعبدالله اى جعفر بن محمد اى (امام ) صادق اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند پيش خدا شفاعت كن براى ما نزد خدا',
    '',
  ],
  [
    'يا اَبَا الْحَسَنِ يا مُوسَى بْنَ جَعْفَرٍ اَيُّهَا الْكاظِمُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى ابا الحسن اى موسى بن جعفر اى كاظم اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما،',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    'یا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ مُوسى اَيُّهَا الرِّضا يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'ای ابا الحسن اى على بن موسى اى (حضرت ) رضا اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو به درگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    'يا اَبا جَعْفَرٍ يا مُحَمَّدَ بْنَ عَلِي اَيُّهَا التَّقِىُّ الْجَوادُ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى ابا جعفر اى محمد بن على اى حضرت تقى جواد اى فرزند رسول خدا اى حجت خدا بر خلق اى آقا و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجتهاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا',
    '',
  ],
  [
    'يا اَبَا الْحَسَنِ يا عَلِىَّ بْنَ مُحَمَّدٍ اَيُّهَا الْهادِى النَّقِىُّ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى ابا الحسن اى على بن محمد اى حضرت هادى نقى اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا',
    '',
  ],
  [
    'يا اَبا مُحَمَّدٍ يا حَسَنَ بْنَ عَلِي اَيُّهَا الزَّكِىُّ الْعَسْكَرِىُّ يَا بْنَ رَسُولِ اللّهِ يا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا',
    'اى ابا محمد اى حسن بن على اى زكى عسكرى اى فرزند رسول خدا اى حجت خدا بر خلق اى آقاى ما و سرور ما',
    '',
  ],
  [
    'اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ يا وَصِىَّ الْحَسَنِ وَالْخَلَفَ الْحُجَّةَ اَيُّهَا الْقاَّئِمُ الْمُنْتَظَرُ الْمَهْدِىُّ يَا بْنَ رَسُولِ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما نزد خدا اى وصى امام حسن عسكرى و يادگار شايسته و حجت اى امام قائم منتظر مهدى اى فرزند رسول خدا',
    '',
  ],
  [
    'یا حُجَّةَ اللّهِ عَلى خَلْقِهِ يا سَيِّدَنا وَمَوْلينا اِنّا تَوَجَّهْنا وَاسْتَشْفَعْنا وَتَوَسَّلْنا بِكَ اِلَى اللّهِ وَقَدَّمْناكَ بَيْنَ يَدَىْ حاجاتِنا',
    'ای حجت خدا بر خلق اى آقا و سرور ما ما رو آورديم و شفيع گرفتيم و توسل جستيم بوسيله تو بدرگاه خدا و تو را پيش روى حاجت هاى خويش قرار داديم',
    '',
  ],
  [
    'يا وَجيهاً عِنْدَ اللّهِ اِشْفَعْ لَنا عِنْدَ اللّهِ',
    'اى آبرومند نزد خدا شفاعت كن براى ما پيش خدا',
    '',
  ],
  [
    null,
    'پس حاجات خود را بطلبد كه برآورده مى شود انشاء اللّه تعالى و در روايت ديگر وارد شده كه بعد از اين بگويد:',
    '',
  ],
  [
    'يا سادَتى وَمَوالِىَّ اِنّى تَوَجَّهْتُ بِكُمْ',
    'اى آقايان من و سرورانم من رو آوردم بوسيله شما',
    '',
  ],
  [
    'اَئِمَّتى وَعُدَّتى لِيَوْمِ فَقْرى وَحاجَتى اِلَى اللّهِ وَتَوَسَّلْتُ بِكُمْ اِلَى اللّهِ',
    'پيشوايان و ذخيرگانم در روز ندارى و نيازمندى بدرگاه خدا و توسل جستم بوسيله شما به درگاه خدا',
    '',
  ],
  [
    'وَاسْتَشْفَعْتُ بِكُمْ اِلَى اللّهِ فَاشْفَعُوا لى عِنْدَ اللّهِ وَاسْتَنْقِذُونى مِنْ ذُنُوبی',
    'و شفاعت جويى كردم بوسيله شما به درگاه خدا پس شفاعت كنيد براى من در پيشگاه خدا و از او بخواهيد مرا از گناهانم نجات دهد',
    '',
  ],
  [
    'عِنْدَ اللّهِ فَاِنَّكُمْ وَسيلَتى اِلَى اللّهِ وَبِحُبِّكُمْ وَبِقُرْبِكُمْ اَرْجُو',
    'زيرا شماييد وسيله من به درگاه خدا و بوسيله دوستى و قرب به شما اميد',
    '',
  ],
  [
    'نَجاةً مِنَ اللّهِ فَكُونُوا عِنْدَ اللّهِ رَجاَّئى يا سادَتى يا اَوْلِياَّءَ اللّهِ',
    'نجات از خدا دارم پس شما هم مايه اميد من به درگاه خدا باشيد اى آقايان من اى اولياء خدا',
    '',
  ],
  [
    'صَلَّى اللّهُ عَلَيْهِمْ اَجْمَعينَ وَلَعَنَ اللّهُ اَعْداَّءَ اللّهِ ظالِميهِمْ مِنَ الاْوَّلينَ وَالاْخِرينَ امينَ رَبَّ الْعالَمينَ',
    'درود خدا بر همگى ايشان و خدا ستم كنندگان به ايشان را كه دشمنان خدا هستند از رحمت خويش دوركند چه آنهاكه گذشته اند و چه آنها كه پس از اين آيند آمين رب العالمين',
    '',
  ],
];
